/*
//Фичи для реализации:

СВОЙСТВА:
ГОТОВО! Цвет чайника из списка (ЛЕГКОМАСШТАБИРУЕМО!)
Марка чайника (Модель чайника)
Объем чайника
Мощность чайника

ОПЦИОНАЛЬНО:
Термометр в чайнике
Защита от "пустого" чайника
Индикатор работы чайника

ВЗАИМОДЕЙСТВИЕ:
Добавление воды (несколько опций)
Выливание всей воды из чайника
Включение чайника
Иммитация работы (нагрев с течением временем)
Расчет нагрева воды в зависмости от налитой воды и мощности
Автоотключение чайника при закипании воды

ОПЦИОНАЛЬНО:
Отслеживание температуры вливаемой воды, подсчет средней температуры

ЗАДАЧА:
Создать структуру объекта через логику ООП. 
Постоянное масштабирование объекта без переписывания кода.
Стуктура подобного объекта?
*/


//БЛОК ЦВЕТ
//Функция смены цвета чайника
let colorKettel = color => {
	kettel = document.querySelector('#electric-kettle');
	kettel.style.fill = color;
};
//База цветов чайника
let colorCode = []; //код цвета
let colorName = []; //наименование цвета
//Функция заполнения массива значениями - код цвета, наменование цвета
let addColor = (code,name) => {
	colorCode.push(code)
	colorName.push(name)
}
//Заполение массива кодом и наименованием цвета
addColor ('Black','Ночной чёрный');
addColor ('Crimson','Насыщенный красный');
addColor ('Tomato','Оранжевый томатный');
addColor ('Gold','Золотой');
addColor ('ForestGreen','Зеленый лесной');
addColor ('DeepSkyBlue','Небесный голубой');
addColor ('RoyalBlue','Королевский синий');
addColor ('Indigo','Индиго');
addColor ('Pink','Нежно-розовый');
//Автозаполнение списка с цветами чайника
let selectColor = [];
for (let i = 0; i < colorName.length;i++){
	selectColor[i] = document.createElement('option');
	selectColor[i].innerHTML = colorName[i];
	document.querySelector('#selectColor').appendChild(selectColor[i])
}
//Подбор значений цвета чайника из списка <option>
let selectElem = document.querySelector('#selectColor')
selectElem.addEventListener('change', () => {
	let index = selectElem.selectedIndex;
	colorKettel(colorCode[index]);
});

//БЛОК МАРКА
//Smeg - дорогой
//Braun - средний
//Еще что-то - дешевый
//Для оптимизации подумать как спрятать большие файлы SVG в отд.файлы
let logo
let logoSmeg = `
<svg 
version="1.0" 
xmlns="http://www.w3.org/2000/svg"
viewBox="0 0 585.000000 64.000000"
preserveAspectRatio="xMidYMid meet">
	<g transform="translate(0.000000,64.000000) scale(0.100000,-0.100000)">
	<path d="M88 594 c-43 -23 -58 -62 -58 -156 0 -89 18 -135 60 -158 11 -6 120
	-15 248 -20 125 -5 228 -9 229 -10 11 -2 33 -36 33 -50 0 -46 -19 -50 -237
	-50 -196 0 -205 1 -210 20 -5 17 -14 20 -64 20 l-59 0 0 -35 c0 -43 22 -88 52
	-109 32 -23 534 -24 577 -1 46 23 64 74 59 172 -3 83 -4 85 -40 119 -30 27
	-46 34 -80 35 -238 4 -417 16 -432 28 -23 19 -21 68 3 81 12 6 100 10 215 10
	l196 0 16 -25 c15 -23 23 -26 68 -23 l51 3 -1 49 c0 43 -5 53 -37 82 l-37 34
	-262 0 c-213 -1 -268 -4 -290 -16z"/>
	<path d="M1710 320 l0 -290 60 0 60 0 0 212 c0 123 4 208 9 203 5 -6 46 -101
	92 -212 l84 -203 60 0 60 0 85 206 c47 113 88 208 93 211 4 2 7 -91 7 -206 l0
	-211 60 0 60 0 0 290 0 291 -97 -3 -98 -3 -80 -193 c-44 -107 -85 -193 -90
	-193 -6 0 -46 87 -90 193 l-80 193 -98 3 -97 3 0 -291z"/>
	<path d="M3490 320 l0 -290 285 0 285 0 0 60 0 60 -225 0 -225 0 0 55 0 55
	225 0 225 0 0 60 0 60 -225 0 -225 0 0 55 0 55 225 0 225 0 0 60 0 60 -285 0
	-285 0 0 -290z"/>
	<path d="M5185 588 c-48 -38 -55 -70 -55 -268 0 -198 7 -230 55 -268 27 -21
	36 -22 297 -22 l270 0 34 34 34 34 0 141 0 141 -170 0 -170 0 0 -60 0 -60 110
	0 110 0 0 -49 c0 -35 -4 -51 -16 -55 -9 -3 -105 -6 -214 -6 -187 0 -200 1
	-210 19 -5 11 -10 80 -10 155 0 109 3 138 16 150 13 14 47 16 220 16 l204 0
	10 -26 c9 -23 14 -25 62 -22 l53 3 3 48 c3 43 0 51 -31 82 l-35 35 -270 0
	c-261 0 -270 -1 -297 -22z"/>
	</g>
</svg>`
let logoBraun = `
<svg 
version="1.0" 
xmlns="http://www.w3.org/2000/svg"
 viewBox="0 0 2115.000000 869.000000"
 preserveAspectRatio="xMidYMid meet">
	<g transform="translate(0.000000,869.000000) scale(0.100000,-0.100000)">
	<path d="M10225 8684 c-303 -30 -439 -63 -620 -148 -264 -125 -479 -336 -601
	-594 -40 -84 -77 -219 -95 -342 -15 -104 -15 170 -11 -4057 l2 -3493 560 0
	560 0 2 1373 3 1372 560 0 560 0 3 -1373 2 -1372 553 2 552 3 0 3735 c0 3467
	-1 3742 -17 3835 -48 284 -155 502 -333 681 -207 208 -467 313 -890 359 -132
	15 -700 28 -790 19z m545 -1297 c139 -49 272 -163 323 -277 55 -122 51 -21 54
	-1667 l3 -1523 -565 0 -565 0 2 1538 3 1537 23 65 c45 123 149 237 275 302
	125 63 308 73 447 25z"/>
	<path d="M18995 6589 c-371 -36 -636 -146 -857 -357 -248 -237 -366 -508 -398
	-916 -6 -82 -10 -1058 -10 -2698 l0 -2568 563 2 562 3 0 140 c-1 77 -2 1155
	-3 2395 -2 2481 -6 2329 59 2450 42 79 149 180 239 225 100 50 185 68 295 62
	242 -14 443 -167 514 -392 14 -45 16 -296 18 -2468 l3 -2417 549 0 548 0 9
	2432 c11 3062 12 2946 -5 3038 -48 270 -165 495 -355 686 -249 250 -515 349
	-1026 384 -172 12 -578 11 -705 -1z"/>
	<path d="M15676 6458 c-3 -51 -10 -1121 -16 -2378 -7 -1326 -15 -2311 -21
	-2348 -5 -34 -18 -86 -29 -116 -99 -264 -437 -413 -711 -313 -204 74 -333 217
	-370 411 -6 31 -9 980 -9 2438 l0 2388 -564 0 -563 0 -6 -397 c-4 -219 -8
	-1406 -9 -2638 -2 -2458 -4 -2335 57 -2564 108 -403 453 -742 878 -865 206
	-60 443 -81 812 -73 488 11 742 55 970 170 111 55 186 108 277 195 186 177
	316 412 369 662 27 127 25 -159 22 3078 l-3 2442 -539 0 -539 0 -6 -92z"/>
	<path d="M10 3285 l0 -3235 1168 0 c703 0 1224 4 1311 11 416 29 620 124 775
	358 98 147 168 351 209 605 21 137 22 162 22 881 0 646 -2 755 -17 860 -32
	222 -84 365 -191 533 l-47 72 65 85 c105 139 149 243 176 420 20 126 20 1391
	1 1545 -43 347 -173 611 -394 801 -176 152 -359 233 -623 276 -88 15 -241 17
	-1277 20 l-1178 4 0 -3236z m1905 2031 c105 -21 178 -52 219 -92 85 -82 95
	-147 96 -585 0 -304 -2 -343 -20 -414 -23 -90 -53 -145 -107 -197 -72 -70 -83
	-72 -505 -76 l-378 -3 0 697 0 697 313 -6 c213 -4 334 -11 382 -21z m20 -2630
	c102 -23 190 -70 226 -119 58 -81 62 -107 67 -500 2 -248 0 -379 -8 -428 -15
	-88 -68 -196 -120 -242 -72 -66 -100 -70 -512 -75 l-368 -4 0 697 0 697 323
	-5 c245 -4 339 -9 392 -21z"/>
	<path d="M4450 3285 l0 -3235 610 0 609 0 -6 1320 -6 1320 521 0 522 0 0
	-1320 0 -1320 620 0 620 0 0 1263 c0 803 -4 1304 -11 1377 -20 228 -64 379
	-155 535 -26 44 -56 96 -67 115 l-20 36 57 69 c79 97 142 227 169 350 22 98
	22 113 22 855 0 821 0 829 -59 1030 -55 190 -159 363 -302 500 -186 179 -372
	268 -656 316 -93 16 -215 18 -1285 21 l-1183 4 0 -3236z m1783 2045 c248 -21
	359 -75 409 -199 22 -54 23 -69 26 -449 3 -429 0 -465 -50 -560 -53 -102 -105
	-141 -213 -161 -35 -7 -197 -11 -402 -11 l-343 0 0 688 c0 379 3 692 7 695 10
	11 433 8 566 -3z"/>
	</g>
</svg>
`
logo = document.createElement('p');
logo.classList.add ('logoBraun');
logo.innerHTML = logoBraun;
document.querySelector('#div1').prepend(logo);
logo = document.createElement('p');
logo.classList.add ('logoSmeg');
logo.innerHTML = logoSmeg;
document.querySelector('#div1').prepend(logo);