/*
КЛАСС: КОНФИГУРАТОР ЧАЙНИКА
//Фичи для реализации:

СВОЙСТВА:
ГОТОВО! Цвет чайника из списка (ЛЕГКОМАСШТАБИРУЕМО!)
Марка чайника (Модель чайника) (ЛЕГКОМАСШТАБИРУЕМО!)
Объем чайника
Мощность чайника

ОПЦИОНАЛЬНО:
Термометр в чайнике
Защита от "пустого" чайника
Индикатор работы чайника

ЗАДАЧА:
Создать структуру объекта через логику ООП. 
Постоянное масштабирование объекта без переписывания кода.
Стуктура подобного объекта?
*/

//БЛОК ЦВЕТ
//Функция смены цвета чайника
let colorKettel = color => {
	kettel = document.querySelector('#electric-kettle');
	kettel.style.fill = color;
};
//База цветов чайника
let colorCode = []; //код цвета
let colorName = []; //наименование цвета
//Функция заполнения массива значениями - код цвета, наменование цвета
let addColor = (code,name) => {
	colorCode.push(code)
	colorName.push(name)
}
//Заполение массива кодом и наименованием цвета
addColor ('Black','Ночной чёрный');
addColor ('Crimson','Насыщенный красный');
addColor ('Tomato','Оранжевый томатный');
addColor ('Gold','Золотой');
addColor ('ForestGreen','Зеленый лесной');
addColor ('DeepSkyBlue','Небесный голубой');
addColor ('RoyalBlue','Королевский синий');
addColor ('Indigo','Индиго');
addColor ('Pink','Нежно-розовый');
//Автозаполнение списка с цветами чайника
let selectColor = [];
for (let i = 0; i < colorName.length;i++){
	selectColor[i] = document.createElement('option');
	selectColor[i].innerHTML = colorName[i];
	document.querySelector('#selectColor').appendChild(selectColor[i])
}
//Подбор значений цвета чайника из списка <option>
let selectElem = document.querySelector('#selectColor')
selectElem.addEventListener('change', () => {
	let index = selectElem.selectedIndex;
	colorKettel(colorCode[index]);
});

//БЛОК БРЕНД
//переменные SVG-логотипов
let logoSmeg = `
<svg 
version="1.0" 
xmlns="http://www.w3.org/2000/svg"
viewBox="0 0 585.000000 64.000000"
preserveAspectRatio="xMidYMid meet">
	<g transform="translate(0.000000,64.000000) scale(0.100000,-0.100000)">
	<path d="M88 594 c-43 -23 -58 -62 -58 -156 0 -89 18 -135 60 -158 11 -6 120
	-15 248 -20 125 -5 228 -9 229 -10 11 -2 33 -36 33 -50 0 -46 -19 -50 -237
	-50 -196 0 -205 1 -210 20 -5 17 -14 20 -64 20 l-59 0 0 -35 c0 -43 22 -88 52
	-109 32 -23 534 -24 577 -1 46 23 64 74 59 172 -3 83 -4 85 -40 119 -30 27
	-46 34 -80 35 -238 4 -417 16 -432 28 -23 19 -21 68 3 81 12 6 100 10 215 10
	l196 0 16 -25 c15 -23 23 -26 68 -23 l51 3 -1 49 c0 43 -5 53 -37 82 l-37 34
	-262 0 c-213 -1 -268 -4 -290 -16z"/>
	<path d="M1710 320 l0 -290 60 0 60 0 0 212 c0 123 4 208 9 203 5 -6 46 -101
	92 -212 l84 -203 60 0 60 0 85 206 c47 113 88 208 93 211 4 2 7 -91 7 -206 l0
	-211 60 0 60 0 0 290 0 291 -97 -3 -98 -3 -80 -193 c-44 -107 -85 -193 -90
	-193 -6 0 -46 87 -90 193 l-80 193 -98 3 -97 3 0 -291z"/>
	<path d="M3490 320 l0 -290 285 0 285 0 0 60 0 60 -225 0 -225 0 0 55 0 55
	225 0 225 0 0 60 0 60 -225 0 -225 0 0 55 0 55 225 0 225 0 0 60 0 60 -285 0
	-285 0 0 -290z"/>
	<path d="M5185 588 c-48 -38 -55 -70 -55 -268 0 -198 7 -230 55 -268 27 -21
	36 -22 297 -22 l270 0 34 34 34 34 0 141 0 141 -170 0 -170 0 0 -60 0 -60 110
	0 110 0 0 -49 c0 -35 -4 -51 -16 -55 -9 -3 -105 -6 -214 -6 -187 0 -200 1
	-210 19 -5 11 -10 80 -10 155 0 109 3 138 16 150 13 14 47 16 220 16 l204 0
	10 -26 c9 -23 14 -25 62 -22 l53 3 3 48 c3 43 0 51 -31 82 l-35 35 -270 0
	c-261 0 -270 -1 -297 -22z"/>
	</g>
</svg>`
let logoBraun = `
<svg 
version="1.0" 
xmlns="http://www.w3.org/2000/svg"
viewBox="0 0 2115.000000 869.000000"
preserveAspectRatio="xMidYMid meet">
	<g transform="translate(0.000000,869.000000) scale(0.100000,-0.100000)">
	<path d="M10225 8684 c-303 -30 -439 -63 -620 -148 -264 -125 -479 -336 -601
	-594 -40 -84 -77 -219 -95 -342 -15 -104 -15 170 -11 -4057 l2 -3493 560 0
	560 0 2 1373 3 1372 560 0 560 0 3 -1373 2 -1372 553 2 552 3 0 3735 c0 3467
	-1 3742 -17 3835 -48 284 -155 502 -333 681 -207 208 -467 313 -890 359 -132
	15 -700 28 -790 19z m545 -1297 c139 -49 272 -163 323 -277 55 -122 51 -21 54
	-1667 l3 -1523 -565 0 -565 0 2 1538 3 1537 23 65 c45 123 149 237 275 302
	125 63 308 73 447 25z"/>
	<path d="M18995 6589 c-371 -36 -636 -146 -857 -357 -248 -237 -366 -508 -398
	-916 -6 -82 -10 -1058 -10 -2698 l0 -2568 563 2 562 3 0 140 c-1 77 -2 1155
	-3 2395 -2 2481 -6 2329 59 2450 42 79 149 180 239 225 100 50 185 68 295 62
	242 -14 443 -167 514 -392 14 -45 16 -296 18 -2468 l3 -2417 549 0 548 0 9
	2432 c11 3062 12 2946 -5 3038 -48 270 -165 495 -355 686 -249 250 -515 349
	-1026 384 -172 12 -578 11 -705 -1z"/>
	<path d="M15676 6458 c-3 -51 -10 -1121 -16 -2378 -7 -1326 -15 -2311 -21
	-2348 -5 -34 -18 -86 -29 -116 -99 -264 -437 -413 -711 -313 -204 74 -333 217
	-370 411 -6 31 -9 980 -9 2438 l0 2388 -564 0 -563 0 -6 -397 c-4 -219 -8
	-1406 -9 -2638 -2 -2458 -4 -2335 57 -2564 108 -403 453 -742 878 -865 206
	-60 443 -81 812 -73 488 11 742 55 970 170 111 55 186 108 277 195 186 177
	316 412 369 662 27 127 25 -159 22 3078 l-3 2442 -539 0 -539 0 -6 -92z"/>
	<path d="M10 3285 l0 -3235 1168 0 c703 0 1224 4 1311 11 416 29 620 124 775
	358 98 147 168 351 209 605 21 137 22 162 22 881 0 646 -2 755 -17 860 -32
	222 -84 365 -191 533 l-47 72 65 85 c105 139 149 243 176 420 20 126 20 1391
	1 1545 -43 347 -173 611 -394 801 -176 152 -359 233 -623 276 -88 15 -241 17
	-1277 20 l-1178 4 0 -3236z m1905 2031 c105 -21 178 -52 219 -92 85 -82 95
	-147 96 -585 0 -304 -2 -343 -20 -414 -23 -90 -53 -145 -107 -197 -72 -70 -83
	-72 -505 -76 l-378 -3 0 697 0 697 313 -6 c213 -4 334 -11 382 -21z m20 -2630
	c102 -23 190 -70 226 -119 58 -81 62 -107 67 -500 2 -248 0 -379 -8 -428 -15
	-88 -68 -196 -120 -242 -72 -66 -100 -70 -512 -75 l-368 -4 0 697 0 697 323
	-5 c245 -4 339 -9 392 -21z"/>
	<path d="M4450 3285 l0 -3235 610 0 609 0 -6 1320 -6 1320 521 0 522 0 0
	-1320 0 -1320 620 0 620 0 0 1263 c0 803 -4 1304 -11 1377 -20 228 -64 379
	-155 535 -26 44 -56 96 -67 115 l-20 36 57 69 c79 97 142 227 169 350 22 98
	22 113 22 855 0 821 0 829 -59 1030 -55 190 -159 363 -302 500 -186 179 -372
	268 -656 316 -93 16 -215 18 -1285 21 l-1183 4 0 -3236z m1783 2045 c248 -21
	359 -75 409 -199 22 -54 23 -69 26 -449 3 -429 0 -465 -50 -560 -53 -102 -105
	-141 -213 -161 -35 -7 -197 -11 -402 -11 l-343 0 0 688 c0 379 3 692 7 695 10
	11 433 8 566 -3z"/>
	</g>
</svg>
`
let logoXiaomi = `
<svg 
version="1.0" 
xmlns="http://www.w3.org/2000/svg"
viewBox="0 0 600.000000 600.000000"
preserveAspectRatio="xMidYMid meet">
	<g transform="translate(0.000000,600.000000) scale(0.100000,-0.100000)">
	<path d="M2325 5989 c-845 -54 -1351 -243 -1740 -651 -333 -348 -494 -782
	-566 -1518 -16 -173 -24 -1214 -10 -1460 33 -573 114 -945 278 -1274 65 -131
	105 -195 191 -305 255 -328 613 -548 1077 -662 359 -88 732 -119 1445 -119
	825 0 1245 45 1639 176 296 99 512 227 720 428 370 360 547 806 617 1566 21
	234 31 1092 15 1399 -29 575 -101 948 -243 1264 -272 605 -775 963 -1538 1096
	-149 26 -353 48 -560 61 -193 12 -1135 11 -1325 -1z m855 -1802 c215 -43 330
	-96 436 -202 104 -104 161 -228 199 -435 23 -128 36 -625 33 -1206 -3 -487 -4
	-513 -22 -533 -19 -20 -27 -21 -314 -21 l-294 0 -34 34 -34 34 0 654 c0 652
	-5 766 -36 878 -32 116 -88 162 -235 195 -101 23 -989 34 -1029 13 l-25 -14
	-5 -868 -5 -868 -33 -29 -32 -29 -280 0 -280 0 -32 29 -33 29 -3 1124 c-1 618
	0 1137 3 1154 3 18 17 44 32 58 l27 27 955 -4 c846 -3 966 -6 1041 -20z m1621
	13 c51 -28 49 19 49 -1217 0 -1023 -2 -1151 -16 -1171 -15 -22 -17 -22 -312
	-22 -259 0 -301 2 -321 16 -53 37 -51 -2 -51 1187 0 608 3 1118 6 1136 4 17
	18 42 32 56 l25 25 284 0 c176 0 292 -4 304 -10z m-2011 -885 c16 -8 34 -24
	40 -34 6 -13 10 -261 10 -726 l0 -707 -29 -29 -29 -29 -297 0 -297 0 -29 29
	-29 29 0 707 c0 463 4 713 10 725 24 46 49 49 343 50 229 0 283 -3 307 -15z"/>
	</g>
</svg>
`
//Модели чайников
let model1 = `
<svg version="1.0" xmlns="http://www.w3.org/2000/svg"
viewBox="0 0 920.000000 980.000000"
preserveAspectRatio="xMidYMid meet"
class="electric-kettle"
id="electric-kettle">
<g transform="translate(0.000000,980.000000) scale(0.100000,-0.100000)">
<path d="M4600 9785 c-120 -23 -247 -91 -339 -184 -85 -85 -130 -155 -169
-263 -24 -65 -27 -87 -27 -210 l0 -138 -70 -20 c-331 -96 -651 -259 -913 -462
-127 -99 -332 -300 -426 -418 -70 -88 -186 -257 -186 -272 0 -4 1056 -8 2346
-8 l2345 0 -28 51 c-39 70 -165 236 -263 347 -144 163 -359 342 -562 468 -220
136 -550 272 -797 327 l-103 23 -3 114 c-3 132 -18 188 -78 305 -80 154 -243
284 -417 330 -82 22 -222 27 -310 10z"/>
<path d="M2261 7400 c-48 -103 -160 -387 -187 -472 l-17 -57 -66 -21 c-220
-71 -531 -215 -730 -339 -691 -432 -1081 -1015 -1152 -1726 -16 -158 -6 -469
20 -640 64 -429 205 -815 434 -1196 169 -280 340 -494 619 -772 l218 -218 0
-329 0 -330 1263 0 1262 0 0 -145 0 -145 -1402 0 -1403 0 0 -505 0 -505 3690
0 3690 0 0 505 0 505 -1480 0 -1480 0 0 145 0 145 1330 0 c732 0 1330 3 1330
8 0 4 7 106 15 227 51 780 44 1710 -20 2455 -54 620 -146 1237 -256 1699 -16
69 -26 128 -22 132 5 4 58 44 120 90 474 355 848 843 998 1304 24 73 65 241
65 265 0 7 -1116 10 -3399 10 l-3398 0 -42 -90z m2696 -371 c97 -25 167 -57
257 -118 706 -477 1086 -1974 855 -3371 -108 -656 -344 -1206 -653 -1527 -199
-208 -383 -305 -601 -320 -790 -52 -1443 1256 -1402 2807 31 1161 420 2126
988 2454 168 97 371 124 556 75z m-3221 -1380 c-136 -670 -235 -1460 -289
-2304 l-12 -180 -80 120 c-184 276 -319 602 -376 909 -30 162 -37 458 -15 597
66 400 310 734 726 992 41 25 76 44 78 43 2 -2 -13 -82 -32 -177z"/>
<path d="M4320 4280 l0 -2060 135 0 135 0 0 265 0 265 395 0 395 0 0 115 0
115 -395 0 -395 0 0 235 0 235 395 0 395 0 0 120 0 120 -395 0 -395 0 0 260 0
260 395 0 395 0 0 120 0 120 -395 0 -395 0 0 235 0 235 395 0 395 0 0 120 0
120 -395 0 -395 0 0 210 0 210 395 0 395 0 0 120 0 120 -395 0 -395 0 0 260 0
260 -135 0 -135 0 0 -2060z"/>
</g>
</svg>`
let model2 = `
<svg version="1.0" xmlns="http://www.w3.org/2000/svg"
viewBox="0 0 460.000000 512.000000"
preserveAspectRatio="xMidYMid meet"
class="electric-kettle"
id="electric-kettle">
<g transform="translate(0.000000,512.000000) scale(0.100000,-0.100000)">
<path d="M3035 5094 c-1022 -37 -1998 -332 -2625 -793 -109 -79 -272 -245
-304 -309 l-27 -53 60 -55 c152 -140 256 -345 308 -601 16 -81 18 -195 20
-1391 l4 -1302 1579 0 1580 0 0 784 0 784 71 118 c80 134 226 429 287 579 92
227 163 477 203 706 31 180 38 505 14 672 -40 286 -130 484 -283 629 -119 112
-255 179 -432 212 -85 17 -298 26 -455 20z m320 -568 c113 -30 198 -97 241
-189 23 -50 24 -59 24 -297 0 -361 -32 -582 -120 -821 -106 -288 -289 -518
-402 -507 -60 6 -59 -8 -56 882 3 788 3 802 24 840 47 90 161 127 289 92z
m-1251 -1386 c157 -55 272 -177 320 -339 24 -80 24 -1366 1 -1456 -82 -315
-434 -463 -715 -302 -98 57 -201 193 -226 300 l-6 27 233 0 c243 0 294 6 324
40 29 32 25 105 -9 138 l-26 27 -265 3 -265 3 0 189 0 190 238 0 c134 0 253 5
275 11 72 20 96 114 43 168 l-26 26 -265 3 -265 3 0 194 0 195 263 0 263 0 29
30 c40 41 40 100 1 139 l-26 26 -261 3 -261 3 6 32 c3 18 21 64 40 102 66 138
214 245 371 268 50 8 154 -4 209 -23z"/>
<path d="M4033 1755 c-125 -63 -235 -120 -243 -127 -38 -32 -63 -90 -63 -147
0 -122 79 -201 202 -201 43 0 79 15 278 114 125 63 238 123 250 135 72 68 80
184 19 264 -41 54 -86 76 -158 77 -53 0 -72 -8 -285 -115z"/>
<path d="M193 376 c-36 -17 -60 -38 -80 -67 -27 -40 -28 -49 -31 -176 l-4
-133 1977 0 1977 0 -4 128 c-5 141 -14 168 -72 220 -20 17 -52 36 -73 41 -26
8 -613 11 -1838 11 l-1800 0 -52 -24z"/>
</g>
</svg>`
let model3 = `
<svg version="1.0" xmlns="http://www.w3.org/2000/svg"
viewBox="0 0 900.000000 957.000000"
preserveAspectRatio="xMidYMid meet"
class="electric-kettle"
id="electric-kettle">
<g transform="translate(0.000000,957.000000) scale(0.100000,-0.100000)">
<path d="M3988 9551 c-110 -36 -167 -88 -194 -178 -8 -26 -20 -130 -26 -230
l-11 -183 -26 0 c-51 0 -368 -30 -481 -46 -595 -81 -1169 -289 -1513 -548
-165 -124 -276 -257 -356 -424 l-35 -72 -295 0 c-414 0 -780 -14 -861 -31 -62
-13 -129 -68 -163 -134 -29 -57 -29 -175 2 -275 31 -99 203 -557 336 -895 189
-478 541 -1386 588 -1515 56 -154 76 -226 126 -455 l40 -180 6 -1335 c7 -1519
21 -2559 34 -2672 6 -42 15 -95 21 -117 12 -44 71 -108 163 -177 69 -51 108
-60 297 -68 205 -9 4595 -15 4835 -7 238 8 252 12 362 95 55 42 121 124 161
201 5 11 13 139 16 295 7 300 17 614 20 617 1 1 215 5 476 8 882 10 892 11
1032 81 198 100 356 283 424 494 26 82 31 629 26 3100 l-4 2105 -37 90 c-82
200 -228 358 -418 454 -131 66 -157 68 -1018 77 l-559 6 -33 36 c-44 50 -88
125 -118 206 -61 162 -127 259 -266 390 -286 269 -764 481 -1352 600 -193 39
-485 77 -643 83 l-142 6 -4 176 c-3 172 -4 177 -34 241 -17 36 -46 83 -64 104
-73 83 -200 114 -312 77z m347 -1231 c330 -16 512 -39 795 -101 292 -64 461
-123 719 -251 123 -61 141 -73 125 -82 -14 -8 -548 -12 -1874 -14 -1020 -2
-1880 -2 -1910 0 l-55 3 96 58 c263 158 681 283 1184 352 312 44 552 53 920
35z m3961 -1375 c15 -11 35 -36 45 -55 18 -33 19 -119 19 -2482 l0 -2446 -52
-46 -53 -46 -617 0 -618 0 0 2551 0 2550 624 -3 c610 -3 625 -3 652 -23z
m-2970 -234 c61 -27 105 -69 155 -145 l39 -59 -1 -2631 c0 -1447 -4 -2680 -8
-2741 -5 -86 -12 -120 -31 -158 -75 -149 -277 -216 -423 -140 -41 21 -104 80
-138 129 l-29 43 0 2756 0 2755 26 43 c97 157 258 215 410 148z m-1051 -396
c31 -12 67 -36 97 -67 106 -109 131 -237 70 -361 -37 -75 -108 -145 -168 -167
-51 -18 -891 -27 -981 -11 -70 13 -155 68 -194 126 -108 158 -53 377 115 462
73 37 146 42 606 39 364 -3 410 -5 455 -21z m15 -2413 c49 -16 124 -95 157
-167 65 -140 5 -320 -133 -401 -61 -36 -168 -43 -654 -40 -353 1 -388 3 -423
20 -65 32 -134 103 -168 172 -29 58 -31 70 -27 134 10 132 92 252 198 285 37
12 129 14 530 11 329 -2 496 -6 520 -14z"/>
</g>
</svg>`
//База наименований чайника
let brandCode = []; //наименование цвета
let brandName = []; //наименование бренда
let brandModel = []; //наименование модели
//Функция заполнения массива значениями - наменование бренда
let addBrand = (code,brand,model) => {
	brandCode.push(code)
	brandName.push(brand)
	brandModel.push(model)
};
addBrand(logoSmeg,'Smeg',model1);
addBrand(logoBraun,'Braun',model2);
addBrand(logoXiaomi,'Xiaomi',model3);
//Автозаполнение списка с брендами чайника
let selectBrand = [];
for (let i = 0; i < brandName.length;i++){
	selectBrand[i] = document.createElement('option');
	selectBrand[i].innerHTML = brandName[i];
	document.querySelector('#celectBrand').appendChild(selectBrand[i])
};
//Подбор значений марки чайника из списка <option>
let selectElem2 = document.querySelector('#celectBrand')
selectElem2.addEventListener('change', () => {
	let index2 = selectElem2.selectedIndex;
	logoKettel(brandName[index2],brandCode[index2],brandModel[index2]);
});
//функция выбора названия бренда и модели
let logoKettel = (brandName,brandCode,brandModel) => {
	//прочистка документа от логотипа
	let logoClass = document.querySelector('.logo');
	logoClass ? logoClass.remove() : false;
	//прочистка от изображения чайника
	let kettelClass = document.querySelector('.center');
	kettelClass ? kettelClass.remove() : false;
	//создание изображения чайника
	kettelImage = document.createElement('p');
	kettelImage.classList.add ('center');
	kettelImage.innerHTML = brandModel;
	document.querySelector('#div1').prepend(kettelImage);
	//создание логотипа
	logo = document.createElement('p');
	logo.classList.add (`logo${brandName}`);
	logo.classList.add ('logo');
	logo.innerHTML = brandCode;
	document.querySelector('#div1').prepend(logo);
};

//Конфигуратор чайника
//class Kettel {
//	constructor(){
//		
//	};
//};